Show / Hide Table of Contents
Class Point3D
Represents an x- , y- an z-coordinates in three-dimensional space.
Inheritance
System.Object
OpenObject
OpenElementId
Point3D
RebarPoint3D
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry3D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry3D.Point3D,CI.Geometry3D", "CI.Geometry3D.IPoint3D,CI.BasicTypes")]
[DataContract]
public class Point3D : OpenElementId
Properties
Improve this Doc   View Source
Name
Gets or sets the Name
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
X
Gets or sets the X-coordinate value
Declaration
[DataMember]
public double X { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Y
Gets or sets the Y-coordinate value
Declaration
[DataMember]
public double Y { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Z
Gets or sets the Z-coordinate value
Declaration
[DataMember]
public double Z { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source